Tekla Open API Reference for Tekla Structures 2025
BaseLinePlacing Constructor
 Creates a new base line placing instance. The given two points define the line to be used for the placing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseLinePlacing(
	Point StartPoint,
	Point EndPoint
)
Public Sub New (
	StartPoint As Point,
	EndPoint As Point
)
Parameters
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The first point of the line.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The second point of the line.
See Also
Reference
BaseLinePlacing Class
Tekla.Structures.Drawing Namespace